interface ICombatFriendly {

    "id": string; //,
    "club": string; //"1",
    "class": string; //IBattleType.Friendly,
    "type": string; //"buhurt",
    "time": string; //"1577801561",
    "weapon": string; //"",
    "teamlimit": string; //"15",
    // "bet": "0.00",
    "team0": string; //"438:366:525:355:457:469:466:418:499:384:443:712:710:551:424",
    "team0eff": string; //"16.71",
    "team1": string; //"603:419:414:607:552:426:557:600:374:478:511:385:522:501:614",
    "comment": string; //"Йохохо!",
    "clubname": string; //"Смертоносные упорыши",
    "img": string; //"001.png",
    "name": string; //"Сергей Новиков",
    "teamnames0": { [id: string]: string };
    /*
    "teamnames0": {
        "438": "Абрам Караулов",
        "366": "Устин Новиков",
        "525": "Любомир Чилаев",
        "355": "Эммануил Суворов",
        "457": "Макс Крутин",
        "469": "Степан Озеров",
        "466": "Евдоким Железкин",
        "418": "Симон Трактирников",
        "499": "Валентин Сапрыкин",
        "384": "Трофим Богун",
        "443": "Захар Ешевский",
        "712": "Алексей Шигаев",
        "710": "Арсений Лещёв",
        "551": "Георгий Ютилов",
        "424": "Потап Шеповалов"
    },
    */
    "teamnames1": { [id: string]: string };
    /*
    "teamnames1": {
        "603": "Степан Суханов",
        "419": "Андрон Муратов",
        "414": "Виталий Шишов",
        "607": "Роман Задорнов",
        "552": "Алексей Булгаков",
        "426": "Вячеслав Минин",
        "557": "Алексей Давыдкин",
        "600": "Кирилл Лешев",
        "374": "Самуил Жвиков",
        "478": "Осип Ковалёв",
        "511": "Федор Клепахов",
        "385": "Мартьян Маклаков",
        "522": "Андроник Бехтерев",
        "501": "Прохор Перехваткин",
        "614": "Филипп Локтионов"
    }
    */
    teamclubs0: { [key: string]: { id: string; img: string } };
    teamclubs1: { [key: string]: { id: string; img: string } };
}
